In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
import sys
sys.path.append("../")
from src.functions import *
#importo las funciones de mi archivo de funciones

In [3]:
attacks = pd.read_csv("attacks.csv") #hago una copia de la base de datos original para trabajar sobre ella
attacks_2 = attacks.copy()

In [4]:
columnas = list(attacks_2.columns)
columnas

['Case Number',
 'Date',
 'Year',
 'Type',
 'Country',
 'Area',
 'Location',
 'Activity',
 'Name',
 'Sex ',
 'Age',
 'Injury',
 'Fatal (Y/N)',
 'Time',
 'Species ',
 'Investigator or Source',
 'pdf',
 'href formula',
 'href',
 'Case Number.1',
 'Case Number.2',
 'original order',
 'Unnamed: 22',
 'Unnamed: 23']

In [5]:
dict_columns = columns_name(columnas)
dict_columns

{'Case Number': 'case_number',
 'Date': 'date',
 'Year': 'year',
 'Type': 'type',
 'Country': 'country',
 'Area': 'area',
 'Location': 'location',
 'Activity': 'activity',
 'Name': 'name',
 'Sex ': 'sex_',
 'Age': 'age',
 'Injury': 'injury',
 'Fatal (Y/N)': 'fatal_(y/n)',
 'Time': 'time',
 'Species ': 'species_',
 'Investigator or Source': 'investigator_or_source',
 'pdf': 'pdf',
 'href formula': 'href_formula',
 'href': 'href',
 'Case Number.1': 'case_number.1',
 'Case Number.2': 'case_number.2',
 'original order': 'original_order',
 'Unnamed: 22': 'unnamed:_22',
 'Unnamed: 23': 'unnamed:_23'}

In [6]:
attacks_2.rename(columns = dict_columns, inplace=True)
attacks_2.columns

Index(['case_number', 'date', 'year', 'type', 'country', 'area', 'location',
       'activity', 'name', 'sex_', 'age', 'injury', 'fatal_(y/n)', 'time',
       'species_', 'investigator_or_source', 'pdf', 'href_formula', 'href',
       'case_number.1', 'case_number.2', 'original_order', 'unnamed:_22',
       'unnamed:_23'],
      dtype='object')

In [7]:
attacks_2.drop(columns=["unnamed:_22","unnamed:_23","pdf", "href_formula", "href", "case_number.1", "case_number.2"], inplace=True)
#elimino las columnas Unnamed 23 y 23 ya que prácticamente todos sus datos son nulos
attacks_2.columns

Index(['case_number', 'date', 'year', 'type', 'country', 'area', 'location',
       'activity', 'name', 'sex_', 'age', 'injury', 'fatal_(y/n)', 'time',
       'species_', 'investigator_or_source', 'original_order'],
      dtype='object')

In [8]:
attacks_2.shape #inspecciono la forma de la base de datos

(25723, 17)

In [9]:
attacks_2.drop_duplicates() #elimino los duplicados
attacks_2.shape 
#al comprobar la forma al eliminar los duplicados vemos que no hay datos duplicados

(25723, 17)

In [10]:
attacks_2.dropna(how="all", inplace=True)
'''Elimino las filas en las que todos sus valores son nulos'''
attacks_2.shape

(8703, 17)

In [11]:
attacks_2.isna().sum()
'''Inspecciono el número de NaN por columna'''

'Inspecciono el número de NaN por columna'

In [12]:
attacks_2["month"] = attacks_2["date"].str.extract(r'([A-Z][a-z][\w+-])')
'''Creo una columna nueva con los meses que la extraigo de Date'''
attacks_2.sample(5)

,case_number,date,year,type,country,area,location,activity,name,sex_,age,injury,fatal_(y/n),time,species_,investigator_or_source,original_order,month
2669,1989.08.22.b,22-Aug-1989,1989.0,Unprovoked,USA,Florida,"St Augustine, St Johns County",Swimming,Anthony McKnight,M,21,3 wounds on left hand,N,NaN,1.2 m [4'] shark,"Orlando Sentinel, 8/24/1989. p.B1",3634.0,Aug
5544,1901.09.23.R,Reported 23-Sep-1901,1901.0,Unprovoked,CYPRUS,Southern Cyprus,Larnaca,Swimming,male,M,Teen,"FATAL, bitten on arms, chest & legs",Y,NaN,2 m shark,"Bardanis citing Embros, 9/23/1901",759.0,Rep
2714,1988.09.28,28-Sep-1988,1988.0,Unprovoked,USA,Florida,"New Smyrna Beach, Volusia County",Surfing,Chris Garvin,M,21,Lacerations to foot,N,Afternoon,5' shark,"News-Journal, 9/29/1988",3589.0,Sep
7393,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4454,1951.00.00,1951,1951.0,Unprovoked,NEW GUINEA,Madang Province,Manam Island,NaN,NaN,NaN,NaN,FATAL,Y,NaN,NaN,"A. Bleakley; A. M. Rapson, p.148",1849.0,NaN

In [13]:
attacks_2.month.value_counts()

Jul    596
Rep    550
Aug    542
Sep    493
Jan    463
Jun    441
Apr    408
Oct    402
Dec    391
Mar    379
Nov    374
May    360
Feb    349
Bef     85
Sum     17
Lat     14
Ear     13
Cir      6
Bet      6
Mid      5
Fal      4
Som      2
Dur      2
Ap-      2
Wor      2
Win      2
Las      1
Spa      1
Ann      1
Aft      1
Let      1
Sai      1
Woi      1
Name: month, dtype: int64

In [14]:
month_lst = ["Jan", "Feb", "Mar", "May", "Apr", "Jun", "Jul", "Ago", "Sep", "Oct", "Nov", "Dec"]
attacks_2["month"].fillna("unknown", inplace = True)
attacks_2["month"] = attacks_2["month"].apply(cambio)
        
attacks_2.sample(5)

,case_number,date,year,type,country,area,location,activity,name,sex_,age,injury,fatal_(y/n),time,species_,investigator_or_source,original_order,month
4450,1951.02.03,03-Feb-1951,1951.0,Unprovoked,AUSTRALIA,New South Wales,"Windang, near the entrance to Lake Illawarra",Spearfishing (but treading water on the surface),Albert Pride,M,20,Shark's fin caused abrasion on his chest,N,NaN,NaN,"G.P. Whitley (1951), p.194 cites Sunday Sun (S...",1853.0,Feb
6471,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,unknown
2658,1989.10.14,14-Oct-1989,1989.0,Invalid,USA,Hawaii,"Kahe Point, O'ahu",Scuba diving,"Ray Mehl, Jr.",M,NaN,Disappeared 15 minutes into shallow dive. Deca...,NaN,16h30,Shark involvement suspected but not confirmed,"Washington Post, 10/17/1989, J. Borg, pp.77-78...",3645.0,Oct
8029,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,unknown
7866,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,unknown

In [15]:
attacks_2.month.value_counts()

unknown    4047
Jul         596
Sep         493
Jan         463
Jun         441
Apr         408
Oct         402
Dec         391
Mar         379
Nov         374
May         360
Feb         349
Name: month, dtype: int64

In [16]:
attacks_month = attacks_2[["month", "country"]][(attacks_2["month"]!="unknown")]
attacks_month

     month       country
0      Jun           USA
1      Jun           USA
2      Jun           USA
3      Jun     AUSTRALIA
4      Jun        MEXICO
...    ...           ...
6151   Jul           USA
6155   Dec           NaN
6159   Jun         ITALY
6160   Mar      BARBADOS
6289   Jul  SOUTH AFRICA

[4656 rows x 2 columns]

In [17]:
attacks_month["month"] = pd.to_datetime(attacks_month["month"], errors="coerce", format = "%b")
attacks_month["month"] = pd.DatetimeIndex(attacks_month['month']).month
attacks_month = attacks_month.sort_values(by="month")
'''Ordeno la base de datos en funcióin de los meses'''
attacks_month.sample(5)

      month    country
1171      1  AUSTRALIA
2596      6        USA
361       9        USA
1900      9        USA
1711     12        USA

In [19]:
attacks_month["country"] = attacks_month["country"].str.lower().str.strip()
'''Con esto limpiamos los paises ya que había algunos datos escritos de forma diferente'''
attacks_month["country"].unique()

array(['south africa', 'australia', 'papua new guinea', 'argentina',
       'costa rica', 'cuba', 'brazil', 'new zealand', 'ecuador',
       'vietnam', 'usa', 'mauritius', 'united arab emirates (uae)',
       'mozambique', 'atlantic ocean', 'columbia', 'new caledonia',
       'indonesia', 'marshall islands', nan, 'new guinea', 'bahamas',
       'mexico', 'fiji', 'turkey', 'japan', 'canada',
       'south atlantic ocean', 'pacific ocean', 'taiwan', 'kenya',
       'reunion', 'chile', 'thailand', 'caribbean sea', 'egypt',
       'uruguay', 'venezuela', 'sierra leone', 'united arab emirates',
       'tasman sea', 'italy', 'india', 'dominican republic', 'guam',
       'england', 'israel', 'sri lanka', 'philippines', 'jamaica',
       'malaysia', 'tonga', 'solomon islands', 'malta', 'turks & caicos',
       'senegal', 'french polynesia', 'trinidad & tobago', 'nicaragua',
       'paraguay', 'cayman islands', 'cook islands', 'bangladesh',
       'north pacific ocean', 'martinique', 'spain', 'yemen', 'sudan',
       'seychelles', 'panama', 'indian ocean', 'barbados',
       'netherlands antilles', 'samoa', 'bermuda', 'somalia',
       'saudi arabia', 'st helena, british overseas territory', 'nigeria',
       'palau', 'western samoa', 'maldives', 'china', 'tobago', 'greece',
       'united kingdom', 'vanuatu', 'grenada', 'iran', 'sudan?',
       'honduras', 'cape verde', 'persian gulf', 'red sea',
       'central pacific', 'iraq', 'south korea', 'namibia', 'tanzania',
       'madagascar', 'france', 'palestinian territories', 'hong kong',
       'mid atlantic ocean', 'new britain', 'coast of africa',
       'british isles', 'lebanon', 'south pacific ocean', 'north sea',
       'montenegro', 'portugal', 'puerto rico', 'singapore',
       'the balkans', 'russia', 'federated states of micronesia',
       'liberia', 'norway', 'croatia', 'falkland islands', 'georgia',
       'comoros', 'java', 'diego garcia', 'ireland', 'egypt / israel',
       'okinawa', 'scotland', 'el salvador', 'andaman / nicobar islandas',
       'nevis', 'mayotte', 'southwest pacific ocean', 'micronesia',
       'british west indies', 'admiralty islands', 'grand cayman',
       'st. maartin', 'peru', 'haiti', 'gulf of aden', 'azores',
       'north atlantic ocean', 'johnston island',
       'red sea / indian ocean', 'solomon islands / vanuatu',
       'san domingo', 'ghana', 'northern arabian sea', 'kiribati',
       'american samoa', 'south china sea', 'maldive islands', 'guinea',
       'british virgin islands', 'guatemala', 'aruba'], dtype=object)

In [21]:
attacks_month.info()
'''
Ahora tenemos attacks_month lista para trabajar nuestra hipótesis y la exportamos
'''

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4656 entries, 2755 to 2909
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   month    4656 non-null   int64
 1   country  4635 non-null   object
dtypes: int64(1), object(1)
memory usage: 109.1+ KB

In [23]:
attacks_month.to_csv("Data/attacks_month.csv", index=False)